tutorials/hotRoom/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor
    	{
        type breadOvenHeater;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        q_              125;
        TStop_          325;
        }

    ceiling
    	{
        type zeroGradient;
        type breadOvenSides;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 300;
        alpha_           10;
        }

    fixedWalls
    	{
            type zeroGradient;
        // type breadOvenSides;
        // refValue        uniform 300;
        // refGradient     uniform 0;
        // valueFraction   uniform 0;
        // value           uniform 300;
        // alpha           10;
        // TInfTableDict   
        // {
        //     file "$FOAM_CASE/constant/TInfTable";
        // }
        }
}


// ************************************************************************* //
