tutorials/hotRoom/constant/TInfTable
(
    // (0 304)
    // (1200 304)
    // (1201 453)
    // (2700 478)
    // (10000 478)
    // (0 453)
    // (1500 478)
    // (10000 478)
    // (0 428)
    // (330 443)
    // (2700 460)
    // (10000 460)
    (0 453)
    (1500 478)
    (10000 478)
)