tutorials/hotRoom/system/blockMeshDictDan
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0) 
    (5 0 0) 
    (5 0 10) 
    (0 0 10) 
    (5 5 0) 
    (5 5 10) 
    (0 5 10) 
    (0 5 0) 
    (2.5 7.5 0) 
    (2.5 7.5 10) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 20) simpleGrading ((20 40 5) (60 20 1) (20 40 0.2) 1 1)
    hex (4 5 6 7 9 10 10 9) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 4 8 7)
            (1 2 5 4)
            (2 3 6 9 5)
            (0 7 6 3)
            (4 5 9 8)
            (6 7 8 9)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (0 1 2 3)
        )
    }
);

mergePatchPairs
(
);


// ************************************************************************* //